Revit 2027 API
BuiltInFailures.LoadFailures.InvalidLineLoadForceDistribution Property
 A line load cannot have forces distributed on both sides of the analytical element. Please review the line load force parameters and try again.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId InvalidLineLoadForceDistribution { get; }
Public Shared ReadOnly Property InvalidLineLoadForceDistribution As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ InvalidLineLoadForceDistribution {
	FailureDefinitionId^ get ();
}
static member InvalidLineLoadForceDistribution : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.LoadFailures Class
Autodesk.Revit.DB Namespace